# Algorithm

In [1]:
import numpy as np
import pandas as pd

## Q1 : compute deviation
<br>Write a function compute_deviation that takes in a list of 
dictionaries with a key and list of integers and returns a 
dictionary with the standard deviation of each list.
Note: This should be done without using the NumPy built-in 
functions.

In [5]:
input = [ { 'key': 'list1', 'values': [4,5,2,3,4,5,2,3], }, { 'key': 'list2', 'values': [1,1,34,12,40,3,9,7], } ]
output = {'list1': 1.12, 'list2': 14.19}

In [6]:
# Method without using numpy
def compute_deviation(dic_list):
    output={}
    for l in dic_list:
        output[l['key']] =round((sum([(x-sum(l['values'])/len(l['values']))**2 for x in l['values']])/len(l['values']))**0.5,2)
    return output
compute_deviation(input)

{'list1': 1.12, 'list2': 14.19}

In [7]:
# Method using numpy
def compute_deviation2(dic_list):
    output = {}
    for l in dic_list:
        output[l['key']]=round(np.std(l['values']),2)
    return output
compute_deviation2(input)

{'list1': 1.12, 'list2': 14.19}

## Q2 : find bigrams
<br>Write a function called find_bigrams that takes a sentence or 
paragraph of strings and returns a list of all bigrams.

In [8]:
sentence = """
Have free hours and love children? 
Drive kids to school, soccer practice 
and other activities.
"""
output = [('have', 'free'),
 ('free', 'hours'),
 ('hours', 'and'),
 ('and', 'love'),
 ('love', 'children?'),
 ('children?', 'drive'),
 ('drive', 'kids'),
 ('kids', 'to'),
 ('to', 'school,'),
 ('school,', 'soccer'),
 ('soccer', 'practice'),
 ('practice', 'and'),
 ('and', 'other'),
 ('other', 'activities.')]

In [10]:
def find_bigrams(words):
    list1 = []
    words_list = words.replace('\n', '').lower().split(" ")
    for i in range(0,len(words_list)-1):
      list1.append((words_list[i],words_list[i+1]))
    return list1
find_bigrams(sentence)

[('have', 'free'),
 ('free', 'hours'),
 ('hours', 'and'),
 ('and', 'love'),
 ('love', 'children?'),
 ('children?', 'drive'),
 ('drive', 'kids'),
 ('kids', 'to'),
 ('to', 'school,'),
 ('school,', 'soccer'),
 ('soccer', 'practice'),
 ('practice', 'and'),
 ('and', 'other'),
 ('other', 'activities.')]

## Q3 : recurring character
<br>Given a string, write a function recurring_char to find its first recurring 
character. Return None if there is no recurring character.
Treat upper and lower case letters as distinct characters.
You may assume the input string includes no spaces.

In [12]:
input1 = "interviewquery"
output1 = "i"

input2 = "interv"
output2 =None

In [13]:
def recurring_char(str_input):
    for i in range(0,len(str_input)):
        if str_input[i] in str_input[i+1:]:
            return (str_input[i])
    return None
print(recurring_char(input1), recurring_char(input2))

i None

## Q4 : replace words with stems
<br>In data science, there exists the concept of stemming, which is the 
heuristic of chopping off the end of a word to clean and bucket it into 
an easier feature set. 
Given a dictionary consisting of many roots and a sentence, write a 
function replace_words to stem all the words in the sentence with the 
root forming it. If a word has many roots that can form it, replace it 
with the root with the shortest length.

In [14]:
roots = ["cat", "bat", "rat"]
sentence = "the cattle was rattled by the battery"
output = "the cat was rat by the bat"

In [15]:
def replace_words(roots,sentence):  
    sorted_roots = sorted(roots, key=len)
    output = []
    words = sentence.split(' ')
    for w in words:
        output.append(w)
        for r in sorted_roots:
            if w.startswith(r):
                output[-1]=r
                break
    return (' '.join(output))
replace_words(roots,sentence)

'the cat was rat by the bat'

## Q5 : minimum change
<br>Write a function find_change to find the minimum number 
of coins that make up the given amount of change cents. 
Assume we only have coins of value 1, 5, 10, and 25 cents.

In [20]:
def minimum_change(cents):
    cnt_25 = cents//25
    rest_25 = cents%25
    cnt_10 = rest_25//10
    rest_10 = rest_25%10
    cnt_5 = rest_10//5
    cnt_1 = rest_10%5
    return (cnt_25+cnt_10+cnt_5+cnt_1)

cents = 73
minimum_change(cents)

7

## Q6 : friendship timeline
<br>There are two lists of dictionaries representing friendship beginnings 
and endings: friends_added and friends_removed. Each dictionary 
contains the user_ids and created_at time of the friendship beginning /
ending.
Write a function friendship_timeline to generate an output that lists the 
pairs of friends with their corresponding timestamps of the friendship 
beginning and then the timestamp of the friendship ending.
Note: There can be multiple instances over time when two people 
became friends and unfriended; only output lists when a corresponding 
friendship was removed.

In [37]:
friends_added = [
 {'user_ids': [1, 2], 'created_at': '2020-01-01'},
 {'user_ids': [3, 2], 'created_at': '2020-01-02'},
 {'user_ids': [4, 1], 'created_at': '2020-02-02'},
 {'user_ids': [2, 1], 'created_at': '2020-02-02'}]
friends_removed = [
 {'user_ids': [1, 2], 'created_at': '2020-02-05'},
 {'user_ids': [2, 1], 'created_at': '2020-01-03'},
 {'user_ids': [2, 3], 'created_at': '2020-01-05'}]

In [36]:
def friendship_timeline(friends_added, friends_removed):
    friends_added_sorted = sorted(friends_added, key = lambda x: x['created_at'])
    friends_removed_sorted = sorted(friends_removed, key = lambda x: x['created_at'])
    friendships = []
    for rem in friends_removed_sorted:
        for add in friends_added_sorted:
            if sorted(rem['user_ids']) == sorted(add['user_ids']):
                friendships.append(
                {
                    'user_ids':sorted(rem['user_ids']),
                    'start_date':add['created_at'],
                    'end_date':rem['created_at'],
                }
                )
                friends_added_sorted.remove(add)
                break
    return (sorted(friendships, key = lambda x : x['user_ids']))

friendship_timeline(friends_added, friends_removed)

[{'user_ids': [1, 2], 'start_date': '2020-01-01', 'end_date': '2020-01-03'},
 {'user_ids': [1, 2], 'start_date': '2020-02-02', 'end_date': '2020-02-05'},
 {'user_ids': [2, 3], 'start_date': '2020-01-02', 'end_date': '2020-01-05'}]

## Q7 : compute variance
<br>Write a function that outputs the (sample) variance given a 
list of integers.
Note: round the result to 2 decimal places.

In [40]:
test_list = [6, 7, 3, 9, 10, 15]

In [46]:
def get_variance(test_list):
    return (round((sum([(x-sum(test_list)/len(test_list))**2 for x in test_list])/len(test_list)),2))

get_variance(test_list)

13.89

## Q8 : multi model sample
<br>Write a function for sampling from a multimodal distribution. 
Inputs are keys (i.e. green, red, blue), weights (i.e. 2, 3, 5.5), and the number of samples drawn from the distribution. The output should return the keys of the samples.

In [52]:
keys = ['green', 'red', 'blue']
weights = [1, 10, 2]
n = 5

from random import random

def sample_multimodal(keys, weights, n):

    '''
    Take a random sample, compare to cdf and append \
the corresponding key to the output list.
    '''
    out = []
    cdf = 0
    for i in range(n):
        rand_samp = random()
        for j in range(len(weights)):
            cdf += (weights[j]/sum(weights))
            if rand_samp <= cdf :
                out.append(keys[j])
                break
        cdf=0
    return out

sample_multimodal(keys, weights, n)

['green', 'blue', 'red', 'blue', 'red']

## Q9 : prime to N
<br>Given an integer N, write a Python function that returns all of 
the prime numbers up to N

In [97]:
def prime_to_N(N):
    output = [2]
    for i in range(3,N,2):
        output.append(i)
        for j in range(3,math.ceil(math.sqrt(i))+1,2):
            if (i!=j) and (i%j) == 0:
                output.remove(i)
                break
    return output
                
        
prime_to_N(25)

[2, 3, 5, 7, 11, 13, 17, 19, 23]

## Q10 : matrix analysis
<br>Let’s say we have a five-by-five matrix num_employees where each 
row is a company and each column represents a department. Each 
cell of the matrix displays the number of employees working in that 
particular department at each company.
Write a function find_percentages to return a five by five matrix that 
contains the portion of employees employed in each department 
compared to the total number of employees at each company.

In [98]:
import numpy as np
#Input:
num_employees = np.array( [[10, 20, 30, 30, 10], [15, 15, 5, 10, 5], 
[150, 50, 100, 150, 50], [300, 200, 300, 100, 100], [1, 5, 1, 1, 2]] )

In [114]:
def find_percentages(num_employees):
    # using broadcasting when calculating on arrays
    return num_employees/num_employees.sum(1).reshape((5, 1))

find_percentages(num_employees)

array([[0.1, 0.2, 0.3, 0.3, 0.1],
       [0.3, 0.3, 0.1, 0.2, 0.1],
       [0.3, 0.1, 0.2, 0.3, 0.1],
       [0.3, 0.2, 0.3, 0.1, 0.1],
       [0.1, 0.5, 0.1, 0.1, 0.2]])

## Q11 : one element removed
<br>There are two lists, list X and list Y. Both lists contain integers 
from -1000 to 1000 and are identical to each other except that 
one integer is removed in list Y that exists in list X.
Write a function one_element_removed that takes in both lists 
and returns the integer that was removed in O(1) space 
and O(n) time without using the python set function.

In [116]:
list_x = [1,2,3,4,5]
list_y = [1,2,4,5]

In [119]:
def one_element_removed(list_x, list_y):
    for i in list_x:
        if i not in list_y:
            return i
            break

one_element_removed(list_x, list_y)

3

In [120]:
def missing_element(listX, listY):   
 
    sumX = 0
    iterX = iter(listX)
    for i in range(len(listX)):
        sumX += next(iterX)
        
    sumY = 0
    iterY = iter(listY)
    for i in range(len(listY)):
        sumY += next(iterY)
        
    return sumX - sumY

missing_element(list_x, list_y)

3

## Q12 : truncated distribution
<br>Given a percentile_threshold, sample size N, and mean and standard 
deviation m and sd of the normal distribution, write a function 
truncated_dist to simulate a normal distribution truncated at percentile_
threshold.

In [121]:
m = 2
sd = 1
n = 6
percentile_threshold = 0.75

In [127]:
from scipy.stats import norm

def truncated_dist(m, sd, n, percentile_threshold):
    threshold_value = norm.ppf(percentile_threshold, loc=m, scale=sd)
    result = []
    while len(result) < n:
        val = norm.rvs(loc=m, scale=sd, size=1)
        if val < threshold_value:
            result.append(round(val[0],1))
    return result

truncated_dist(m, sd, n, percentile_threshold)

[2.0, 1.7, 1.7, 1.0, 0.8, 2.2]

## Q13 : gaussian generation
<br>Given two parameters, a size n, a mean mu and sigma sigma 
write a function to generate a gaussian distribution.

In [18]:
from scipy.stats import norm

def generate_gaussian(n, mu, sigma):
    r= norm.rvs(size= n, loc= mu, scale= sigma)
    # if using numpy, np.random.normal(mu, sigma, n)
    return sorted(r.round().astype(int))

generate_gaussian(9, 3, 1)

[1, 2, 2, 2, 3, 3, 3, 3, 4]

## Q14 : term frequency
<br>Say you are given a text document in the form of a string 
with the following sentences:
document = "I have a nice car with a nice tire".
Write a program in python to determine the TF 
(term_frequency) values for each term of this 
document.
Note: Round the term frequency to 2 decimal 
points

In [29]:
def tf(sentence):
    words = sentence.split(' ')
    output = {}
    for w in words:
        if w in output.keys():
            output[w]+=1/len(words)
        else:
            output[w]=1/len(words)
    output = {key : round(output[key], 2) for key in output}
    return output

document = "I have a nice car with a nice tire"
tf(document)

{'I': 0.11,
 'have': 0.11,
 'a': 0.22,
 'nice': 0.22,
 'car': 0.11,
 'with': 0.11,
 'tire': 0.11}

## Q15 : greater release dates
<br>Given two lists of release dates, return the list with more 
dates past a certain input variable date D.
Note: Both lists could be of unequal length and in any order.

In [33]:
D = "2020-03-01"
L1 = [
 "2020-01-21", 
 "2020-01-09",
 "2020-01-10",
 "2020-02-14",
 "2020-03-01"
]
L2 = [
 "2020-01-20", 
 "2020-04-02",
 "2020-02-08",
 "2020-03-01"
]

In [38]:
def greater_release_dates(L1, L2, D):
    if sum([i > D for i in L1]) > sum([i > D for i in L2]):
        return "L1"
    elif sum([i > D for i in L1]) < sum([i > D for i in L2]):
        return "L2"
    else: 
        return "L1 or L2"

In [39]:
greater_release_dates(L1, L2, D)

'L2'

## Q16 : find mismatched words
<br>You are given two sentences as strings. Create a function that 
returns a list of all words that are not in both sentences.
You can assume that the sentences have no punctuation 
marks, extra tabs, or spaces.
Note: The strings "Game" and "game" should be considered 
the same word. Because of this, make sure all the strings in 
the list you output are in lowercase.

In [41]:
string1 = "I want to eat fish today with my friends"
string2 = "All I want is to eat fish today with my friends"

In [64]:
set(string2.lower().split(' ')) ^ set(string1.lower().split(' '))
#(set(string2.lower().split(' ')) - set(string1.lower().split(' '))) | (set(string1.lower().split(' ')) - set(string2.lower().split(' ')))

{'all', 'is'}

## Q17 : fill none value
<br>Given a sorted list of positive integers with some entries being 
None, create a function to return a new list where all None 
values are replaced with the most recent non-None value in 
the list.
Note: If the first entry in the list is None, assume the previous 
entry was 0.

In [93]:
input_list = [None,2,None,None,4,5,None]

In [91]:
def fill_none(input_list):
    output_list = []
    if input_list[0] is None:
        output_list.append(0)
    else:
        output_list.append(input_list[0])
    for i in range(1,len(input_list)):
        if input_list[i] is not None:
            output_list.append(input_list[i])
        else:
            output_list.append(output_list[i-1])
    return output_list

In [94]:
fill_none(input_list)

[0, 2, 2, 2, 4, 5, 5]

## Q18 : precision recall
<br>Given a 2-D matrix P of predicted values and actual values, 
write a function precision_recall to calculate precision and 
recall metrics.
Return the ordered pair (precision, recall).

In [146]:
 P = [[121, 9],
 [17, 144]]

In [150]:
def precision_recall(P):
    return (round(P[0][0]/(P[0][0]+P[1][0]),3),round(P[0][0]/(P[0][0]+P[0][1]),3))
precision_recall(P)

(0.877, 0.931)

## Q19 : density to cumulative
<br>Given a list pdf write a function to_cdf(pdf) to caluculate the 
cdf.

In [205]:
pdf = [1.2, 3.4, 5.3]

def to_cdf(pdf):
    output = []
    a = 0
    for i in range(len(pdf)):
        a+=pdf[i]
        output.append(round(a,3))
    return output
    #return np.cumsum(pdf)

to_cdf(pdf)

[1.2, 4.6, 9.9]

## Q20 : split data without pandas
<br>You are given a string that resembles the declaration of a list of 
dictionaries. Without using pandas, write a function read_split_from_str 
that:
1.Reads the data and encodes it as a list of dictionaries
2.Split the data into two lists, one for training and one for testing, with 
a 70:30 split between the training set and the testing set. Use numpy 
for random number generation if you need. Return a list of [training_
set,testing_set]

In [164]:
list_of_dict_string = "[{'x': 0.0, 'y': 5.43}, {'x': 50.0, 'y': 102.78}, {'x': 100.0, 'y': 204.24}]"

In [191]:
import numpy as np
def read_split_from_str(list_of_dict_string):
    list1 = eval(list_of_dict_string)
    np.random.shuffle(list1)
    output1 = list1[0:round(0.7*len(list1))]
    output2 = list1[round(0.7*len(list1)):]
    return ([output1, output2])

read_split_from_str(list_of_dict_string)

[[{'x': 50.0, 'y': 102.78}, {'x': 0.0, 'y': 5.43}],
 [{'x': 100.0, 'y': 204.24}]]

## Q21 : word frequency
<br>You’re hired by a literary newspaper for an unusual project. They want 
you to use your data science skills to parse the most frequent words 
used in poems.
Poems are given as a list of strings called sentences. Return a 
dictionary of the frequency that words are used in the poem.
Your keys should be a number representing the number of times the 
word is used in the poem, with its value being a list of words with that 
frequency.
Make sure to process all words as entirely lowercase. Additionally, do 
not worry about parsing punctuation marks.

In [193]:
sentences = [
 "I love roses",
 "Roses are the best",
 "Roses are red violets are blue"
]

In [241]:
def word_frequency(sentences):
    list1 = [i.lower().split(' ') for i in sentences]
    list2 = [j for sub in list1 for j in sub]
    dict1 = {}
    dict2 = {}
    for i in list2:
        if i in dict1.keys():
            dict1[i] +=1
        else:
            dict1[i] = 1
    for v in dict1.values():
        dict2[v] = list()
    for j in dict1.keys():
        if dict1[j] in dict2.keys():
            dict2[dict1[j]].append(j)
        else:
            dict2[dict1[j]]=j
    return dict2

In [242]:
word_frequency(sentences)

{1: ['i', 'love', 'the', 'best', 'red', 'violets', 'blue'],
 3: ['roses', 'are']}

## Q22 : automatic histogram
<br>Given a list of integers called dataset, write a function called 
automatic_histogram to automatically generate a dictionary 
representing a histogram of the data set with x bins uniformly 
distributed over the values.
Note: You should not include any bins that have zero values in them in 
your dictionary.
Note: Do NOT use numpy or pandas.

In [264]:
x = 4
dataset = [1,2,2,3,4,5]

{'1-2': 3, '3-4': 2, '5': 1}

# Numpy and Pandas

## Q0: Rewrite SQL Queries in Pandas

In [210]:
import pandas as pd
import numpy as np
airports = pd.read_csv('airports.csv')
airport_freq = pd.read_csv('airport-frequencies.csv')
runways = pd.read_csv('runways.csv')

In [213]:
airports.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73081 entries, 0 to 73080
Data columns (total 18 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 73081 non-null  int64
 1   ident              73081 non-null  object
 2   type               73081 non-null  object
 3   name               73081 non-null  object
 4   latitude_deg       73081 non-null  float64
 5   longitude_deg      73081 non-null  float64
 6   elevation_ft       59116 non-null  float64
 7   continent          37737 non-null  object
 8   iso_country        72822 non-null  object
 9   iso_region         73081 non-null  object
 10  municipality       67948 non-null  object
 11  scheduled_service  73081 non-null  object
 12  gps_code           42818 non-null  object
 13  iata_code          9205 non-null   object
 14  local_code         32793 non-null  object
 15  home_link          3461 non-null   object
 16  wikipedia_link     10634 non-null  object
 17  keywords           13671 non-null  object
dtypes: float64(3), int64(1), object(14)
memory usage: 10.0+ MB

In [215]:
airports.shape

(73081, 18)

In [229]:
pd.DataFrame(airports.isnull().sum()).reset_index().rename(columns = {'index':'field', 0:'null count'})

                field  null count
0                  id           0
1               ident           0
2                type           0
3                name           0
4        latitude_deg           0
5       longitude_deg           0
6        elevation_ft       13965
7           continent       35344
8         iso_country         259
9          iso_region           0
10       municipality        5133
11  scheduled_service           0
12           gps_code       30263
13          iata_code       63876
14         local_code       40288
15          home_link       69620
16     wikipedia_link       62447
17           keywords       59410

In [208]:
airports.describe()

                  id  latitude_deg  longitude_deg  elevation_ft
count   73081.000000  73081.000000   73081.000000  59116.000000
mean   148862.902533     25.831326     -29.063121   1297.544573
std    153650.855665     26.217469      85.878061   1671.143589
min         2.000000    -90.000000    -179.876999  -1266.000000
25%     18502.000000     12.671400     -94.159103    205.000000
50%     39394.000000     35.171570     -69.916667    730.000000
75%    331399.000000     42.756810      23.671694   1604.000000
max    356666.000000     82.750000     179.975700  17372.000000

In [204]:
airports['type'].value_counts()

small_airport     38850
heliport          18496
closed             9394
medium_airport     4745
seaplane_base      1111
large_airport       448
balloonport          37
Name: type, dtype: int64

In [20]:
airport_freq.head()

,id,airport_ref,airport_ident,type,description,frequency_mhz
0,70518,6528,00CA,CTAF,CTAF,122.9
1,307581,6589,01FL,ARCAL,NaN,122.9
2,75239,6589,01FL,CTAF,CEDAR KNOLL TRAFFIC,122.8
3,60191,6756,04CA,CTAF,CTAF,122.9
4,59287,6779,04MS,UNIC,UNICOM,122.8

In [243]:
runways.head()

,id,airport_ref,airport_ident,length_ft,width_ft,surface,lighted,closed,le_ident,le_latitude_deg,le_longitude_deg,le_elevation_ft,le_heading_degT,le_displaced_threshold_ft,he_ident,he_latitude_deg,he_longitude_deg,he_elevation_ft,he_heading_degT,he_displaced_threshold_ft
0,269408,6523,00A,80.0,80.0,ASPH-G,1,0,H1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,255155,6524,00AK,2500.0,70.0,GRVL,0,0,N,NaN,NaN,NaN,NaN,NaN,S,NaN,NaN,NaN,NaN,NaN
2,254165,6525,00AL,2300.0,200.0,TURF,0,0,01,NaN,NaN,NaN,NaN,NaN,19,NaN,NaN,NaN,NaN,NaN
3,270932,6526,00AR,40.0,40.0,GRASS,0,0,H1,NaN,NaN,NaN,NaN,NaN,H1,NaN,NaN,NaN,NaN,NaN
4,322128,322127,00AS,1450.0,60.0,Turf,0,0,1,NaN,NaN,NaN,NaN,NaN,19,NaN,NaN,NaN,NaN,NaN

In [263]:
runways[runways.lighted==1].groupby(['id','airport_ref']).size().reset_index().rename(columns={0:'count'}).sort_values('count',ascending = False)

           id  airport_ref  count
0      232758         6402      1
7456   244475        18866      1
7448   244467         3771      1
7449   244468         3771      1
7450   244469         3771      1
...       ...          ...    ...
3728   239318         5512      1
3729   239319         5514      1
3730   239320         5524      1
3731   239321         5520      1
11179  356601        45518      1

[11180 rows x 3 columns]

In [24]:
# select distinct type from airports
airports.type.unique()

array(['heliport', 'small_airport', 'closed', 'seaplane_base',
       'balloonport', 'medium_airport', 'large_airport'], dtype=object)

In [50]:
# select ident, name, municipality from airports where iso_region = 'US-CA' and type not in ('seaplane_base', 'large_airport') order by ident desc
# not in = ~
airports[(airports.iso_region == 'US-CA') & ~airports['type'].isin(['seaplane_base','large_airport'])][['ident','name','municipality']].sort_values('ident',ascending=False)

         ident                              name municipality
69760     WJBK       Berkeley Municipal Heliport      Oakland
67748  US-CA64  Gilbreath Bros Duck Club Airport        Wasco
67742  US-7099      Laguna Seca Raceway Heliport     Monterey
67678  US-7035             Dumont Dunes Heliport        Baker
67665  US-7022             Pilibos Ranch Airport      Mendota
...        ...                               ...          ...
70        01CL         Swansboro Country Airport  Placerville
69        01CA      SCE Lugo Substation Heliport     Hesperia
9         00CN   Kitchen Creek Helibase Heliport  Pine Valley
8         00CL               Williams Ag Airport        Biggs
7         00CA           Goldstone (GTS) Airport      Barstow

[2259 rows x 3 columns]

In [68]:
# select iso_country, type, count(*) as cnt from airports group by 1,2
airports.groupby(['iso_country','type']).size().reset_index(name = 'cnt')
# size() in pandas is the same as count()

    iso_country            type  cnt
0            AD          closed    1
1            AD        heliport    2
2            AE          closed    3
3            AE        heliport  200
4            AE   large_airport    4
..          ...             ...  ...
951          ZW          closed    6
952          ZW        heliport    5
953          ZW   large_airport    1
954          ZW  medium_airport    8
955          ZW   small_airport  135

[956 rows x 3 columns]

In [209]:
airports.groupby('iso_country')['latitude_deg'].describe()

,count,mean,std,min,25%,50%,75%,max
iso_country,,,,,,,,
AD,3.0,42.534156,0.019866,42.511228,42.528106,42.544983,42.545620,42.546257
AE,248.0,24.714958,0.616001,22.710570,24.351277,24.745523,25.279559,26.049600
AF,77.0,34.583115,1.873120,30.303216,33.333401,34.506716,36.282828,38.461708
AG,4.0,17.487323,0.236336,17.136700,17.450874,17.588397,17.624845,17.635799
AI,2.0,18.246446,0.058935,18.204773,18.225610,18.246446,18.267283,18.288120
...,...,...,...,...,...,...,...,...
YE,38.0,14.703529,1.417538,12.630700,13.884363,14.606950,15.474532,18.720709
YT,1.0,-12.809319,NaN,-12.809319,-12.809319,-12.809319,-12.809319,-12.809319
ZA,638.0,-28.559998,3.214714,-46.875999,-30.763351,-28.344300,-26.012300,-22.356001
ZM,123.0,-14.173020,2.358596,-18.019170,-15.837841,-14.375891,-12.833400,-8.428730
ZW,155.0,-18.534917,1.686944,-22.197617,-19.928467,-18.216999,-17.166769,-15.647438

In [93]:
# select iso_country, type, count(distinct gps_code) as gps_cnt from airports group by 1,2 order by iso_country, gps_cnt desc
airports.groupby(['iso_country','type'])['gps_code'].nunique().reset_index(name='gps_cnt').sort_values(['iso_country','gps_cnt'],ascending=[True, False])

    iso_country            type  gps_cnt
0            AD          closed        0
1            AD        heliport        0
7            AE   small_airport       14
5            AE  medium_airport        7
4            AE   large_airport        4
..          ...             ...      ...
955          ZW   small_airport       84
954          ZW  medium_airport        8
951          ZW          closed        2
953          ZW   large_airport        1
952          ZW        heliport        0

[956 rows x 3 columns]

In [102]:
# select type, count(*) as cnt from airports group by 1 having cnt > 3000
airports.groupby('type').size().reset_index(name='cnt').query('cnt>3000').sort_values('cnt')

             type    cnt
4  medium_airport   4745
1          closed   9394
2        heliport  18496
6   small_airport  38850

In [202]:
# select type, count(distinct name) as name from airports group by 1 having name > 3000
airports.groupby('type')['name'].nunique().reset_index().query('name>3000').sort_values('name')

             type   name
4  medium_airport   4734
1          closed   9226
2        heliport  17933
6   small_airport  36529

In [138]:
#select id, length_ft from runways order by length_ft limit 5 offset 5
#runways.sort_values('length_ft').reset_index().loc[5:9][['id','length_ft']]
runways.nsmallest(10,columns='length_ft')[['id','length_ft']].tail(5)

           id  length_ft
42881  259295        0.0
25452  260341        2.0
18877  267780        4.0
2689   265561        8.0
642    265154       10.0

In [154]:
#select min(length_ft) min_lf, max(length_ft) max_lf, mean(length_ft) mean_lf, median(length_ft) median_lf from runways
runways.agg({'length_ft':['min','max','mean','median']}).round(1).T.rename(columns = {'min': 'min_lf', 'max': 'max_lf','mean': 'mean_lf', 'median': 'median_lf'}).reset_index()

       index  min_lf   max_lf  mean_lf  median_lf
0  length_ft     0.0  30000.0   3246.5     2700.0

In [163]:
# select airport_ident, type, description, frequency_mhz from airport_freq af join airports a on af.airport_ref = a.id where a.ident = 'KLAX'
airport_freq.merge(airports[airports['ident']=='KLAX'],how='inner',left_on = 'airport_ref', right_on = 'id')[['airport_ident','type_x','description','frequency_mhz']].rename(columns = {'type_x':'type'})

   airport_ident  type description  frequency_mhz
0           KLAX   APP   SOCAL APP          36.07
1           KLAX   APP   SOCAL APP         124.30
2           KLAX  ATIS        ATIS         133.80
3           KLAX   CLD    CLNC DEL         121.40
4           KLAX   DEP   SOCAL DEP         124.30
5           KLAX   GND         GND         121.65
6           KLAX  MISC          CG          34.50
7           KLAX  MISC          CG         898.40
8           KLAX   OPS          AF          37.22
9           KLAX   TWR         TWR         119.80
10          KLAX  UNIC      UNICOM         122.95

In [172]:
#union
pd.concat([airports[airports['ident']=='KLAX'][['name','municipality']], airports[airports['ident']=='KLGB'][['name','municipality']]]).drop_duplicates()

                                       name municipality
35701     Los Angeles International Airport  Los Angeles
35727  Long Beach Airport (Daugherty Field)   Long Beach

In [180]:
airports.loc[airports['ident']=='KLAX','home_link'] = 'feifangu@outlook.com'

## Q1: Naive Forecasting
<br> Some forecasting methods are extremely simple and surprisingly effective. Naïve forecast is one of them; we simply set all forecasts to be the value of the last observation. Our goal is to develop a naïve forecast for a new metric called "distance per dollar" defined as the (distance_to_travel/monetary_cost) in our dataset and measure its accuracy.

To develop this forecast,  sum "distance to travel"  and "monetary cost" values at a monthly level before calculating "distance per dollar". This value becomes your actual value for the current month. The next step is to populate the forecasted value for each month. This can be achieved simply by getting the previous month's value in a separate column. Now, we have actual and forecasted values. This is your naïve forecast. Let’s evaluate our model by calculating an error matrix called root mean squared error (RMSE). RMSE is defined as sqrt(mean(square(actual - forecast)). Report out the RMSE rounded to the 2nd decimal spot.

In [2]:
import numpy as np
import pandas as pd

uber_request_logs = pd.DataFrame({"request_id": [1,2,3],
                                  "request_date": pd.to_datetime(["2022-01-09 00:00:00", "2022-01-24 00:00:00", "2022-02-08 00:00:00"]),
                                  "request_status": ['success', 'success', 'fail'],
                                  'distance_to_travel': [70.59, 93.36, 51.24],
                                  'monetary_cost': [6.56, 22.68, 11.39],
                                  'driver_to_client_distance': [14.36, 19.9, 21.32]
                                                                })

In [3]:
uber_request_logs

,request_id,request_date,request_status,distance_to_travel,monetary_cost,driver_to_client_distance
0,1,2022-01-09,success,70.59,6.56,14.36
1,2,2022-01-24,success,93.36,22.68,19.90
2,3,2022-02-08,fail,51.24,11.39,21.32

In [4]:
uber_request_logs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   request_id                 3 non-null      int64
 1   request_date               3 non-null      datetime64[ns]
 2   request_status             3 non-null      object
 3   distance_to_travel         3 non-null      float64
 4   monetary_cost              3 non-null      float64
 5   driver_to_client_distance  3 non-null      float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(1)
memory usage: 272.0+ bytes

In [5]:
uber_request_logs['year_month'] = uber_request_logs['request_date'].dt.to_period('M')

In [6]:
uber_request_logs

,request_id,request_date,request_status,distance_to_travel,monetary_cost,driver_to_client_distance,year_month
0,1,2022-01-09,success,70.59,6.56,14.36,2022-01
1,2,2022-01-24,success,93.36,22.68,19.90,2022-01
2,3,2022-02-08,fail,51.24,11.39,21.32,2022-02

In [12]:
#avg_monthly_dist_per_dollar = uber_request_logs.groupby('year_month')[['distance_to_travel','monetary_cost']].sum().reset_index()
avg_monthly_dist_per_dollar = uber_request_logs.groupby('year_month').agg({'distance_to_travel':sum,'monetary_cost':'sum'}).reset_index()

In [13]:
avg_monthly_dist_per_dollar

  year_month  distance_to_travel  monetary_cost
0    2022-01              163.95          29.24
1    2022-02               51.24          11.39

In [117]:
avg_monthly_dist_per_dollar['monthly_dist_per_dollar'] = avg_monthly_dist_per_dollar['distance_to_travel'] / avg_monthly_dist_per_dollar['monetary_cost']

In [118]:
avg_monthly_dist_per_dollar['naive_forecast'] =  avg_monthly_dist_per_dollar['monthly_dist_per_dollar'].shift(1)

In [121]:
df = avg_monthly_dist_per_dollar.loc[1:,]

In [122]:
round(np.sqrt(np.mean(np.square(df['monthly_dist_per_dollar'] - avg_monthly_dist_per_dollar['naive_forecast']))),2)

1.11

## Q2: Distance Per Dollar
<br>You’re given a dataset of uber rides with the traveling distance (‘distance_to_travel’) and cost (‘monetary_cost’) for each ride. For each date, find the difference between the distance-per-dollar for that date and the average distance-per-dollar for that year-month. Distance-per-dollar is defined as the distance traveled divided by the cost of the ride.

The output should include the year-month (YYYY-MM) and the absolute average difference in distance-per-dollar (Absolute value to be rounded to the 2nd decimal).
You should also count both success and failed request_status as the distance and cost values are populated for all ride requests. Also, assume that all dates are unique in the dataset. Order your results by earliest request date first.

In [124]:
uber_request_logs = pd.DataFrame({"request_id": [1,2,3,4,5],
                                  "request_date": pd.to_datetime(["2022-01-09 00:00:00", "2022-01-24 00:00:00", 
                                                                  "2022-02-08 00:00:00", "2022-02-23 00:00:00", "2022-03-09 00:00:00"]),
                                  "request_status": ['success', 'success', 'fail', 'success', 'success'],
                                  'distance_to_travel': [70.59, 93.36, 51.24, 61.58, 25.04],
                                  'monetary_cost': [6.56, 22.68, 11.39, 8.04, 7.19],
                                  'driver_to_client_distance': [14.36, 19.9, 21.32, 44.26, 1.74]
                                                                })

In [127]:
uber_request_logs['distance_per_dollar'] = uber_request_logs['distance_to_travel'] / uber_request_logs['monetary_cost']

In [128]:
uber_request_logs['year_month'] = uber_request_logs['request_date'].dt.to_period('M')

In [131]:
uber_request_logs['monthly_distance_per_dollar'] = uber_request_logs.groupby('year_month')['distance_to_travel'].transform('sum')/uber_request_logs.groupby('year_month')['monetary_cost'].transform('sum')

In [132]:
uber_request_logs['diff'] = np.abs(uber_request_logs['distance_per_dollar'] - uber_request_logs['monthly_distance_per_dollar'])

In [137]:
uber_request_logs.groupby('year_month')['diff'].mean().round(2).reset_index().sort_values(by=['year_month'])

  year_month  diff
0    2022-01  3.32
1    2022-02  1.58
2    2022-03  0.00

## Q3: Highest Total Miles
<br> You’re given a table of Uber rides that contains the mileage and the purpose for the business expense.  You’re asked to find business purposes that generate the most miles driven for passengers that use Uber for their business transportation. Find the top 3 business purpose categories by total mileage.

In [139]:
my_uber_drives = pd.DataFrame({'start_date': pd.to_datetime(["2016-01-01 21:11:00", "2016-01-02 01:25:00", 
                               "2016-01-02 20:25:00", "2016-01-05 17:31:00", "2016-01-06 14:42:00"]),
                               'end_date': pd.to_datetime(["2016-01-01 21:17:00", "2016-01-02 01:37:00", 
                               "2016-01-02 20:38:00", "2016-01-05 17:45:00", "2016-01-06 15:49:00"]),
                               'category': ['Business', 'Business', 'Business', 'Business', 'Business'],
                               'start': ['Fort Pierce','Fort Pierce','Fort Pierce','Fort Pierce','Fort Pierce'],
                               'stop': ['Fort Pierce','Fort Pierce','Fort Pierce','Fort Pierce','West Palm Beach'],
                               'miles': [5.1, 5, 4.8, 4.7, 63.7],
                               'purpose':['a','b','c','d','a']
                                                                })

In [145]:
my_uber_drives[my_uber_drives['category']=='Business'].groupby('purpose')['miles'].sum().reset_index().sort_values(by=['miles'],ascending=False).head(3)
# or use .rank(method='min',ascending=False), df['rank']<=3

  purpose  miles
1       b   68.7
0       a    9.8
2       c    4.8

In [230]:
df = pd.DataFrame({'A': 'a a b'.split(),
                   'B': [1,2,3],
                   'C': [4,6,5]})

In [239]:
df

   A  B  C
0  a  1  4
1  a  2  6
2  b  3  5

In [236]:
df.groupby('A')[['B', 'C']].transform(lambda x: x / x.sum())

   B   C
0  3  10
1  3  10
2  3   5

In [242]:
df.groupby('A', group_keys=True)[['B', 'C']].apply(lambda x: x / x.sum())

          B    C
0  0.333333  0.4
1  0.666667  0.6
2  1.000000  1.0